# MySQL Relational Database


<img src="datamodel.png" alt="Data Model" style="width: 300px; float: right; margin-left: 20px; border: 1px solid">

This sample database has the hospitals, systems, services, and visits information we talked about in the slides.  The model (table names, columns, and relationships) is show to the right.

In this model, there are four tables:
* System Affiliations
* Hospitals
* ED Visits
* Hospital Services

In these examples, we're going to ask a few questions and answer them with both SQL and Python Pandas data processes.

## Setup

Create a connection to the MySQL database

In [1]:
import os
import pymysql
from sqlalchemy import create_engine
import pandas as pd

In [2]:
host = 'slucor2020.cgdcoitnku0k.us-east-1.rds.amazonaws.com'
port = '3306'
user = 'slucor2020'
password = 'SLUcor2020'
database = 'hds5210'

In [3]:
conn = create_engine('mysql+pymysql://' + 
                     user + ':' + 
                     password + '@' + 
                     host + '/' + 
                     database, echo=False)

## Give me a list of hospitals

In [4]:
pd.read_sql_query("SELECT * FROM hospitals", conn)

  hospital_name       city system_name  beds
0           BJH  St. Louis         BJC  1243
1     Mercy STL      Ladue       Mercy  1120
2         MoBap      Ladue         BJC   443

# All the hospitals that are not affiliated with the Catholic church

Using SQL, we join the hospitals with system_affiliations tables to get a list of hospitals.

In [5]:
pd.read_sql_query("""
  SELECT h.*, s.affiliation
  FROM 
    hospitals h JOIN
    system_affiliations s ON h.system_name = s.system_name
  WHERE
    s.affiliation != 'Catholic'
""", conn)

  hospital_name       city system_name  beds    affiliation
0           BJH  St. Louis         BJC  1243  Non-Religious
1         MoBap      Ladue         BJC   443  Non-Religious

## Read in all the DB tables into an array of Dataframes

1. Get a list of all of the tables
2. Read each table into a dataframe; and
3. Store that in a dictionary of dataframes

In [6]:
df = pd.read_sql_query("SHOW TABLES", conn)

In [7]:
df

     Tables_in_hds5210
0            ed_visits
1    hospital_services
2            hospitals
3        paulboal_data
4           population
5  system_affiliations

In [8]:
tables = {}

for n,t in pd.read_sql_query("SHOW TABLES", conn).iterrows():
    name = str(t['Tables_in_hds5210'])
    print(name)
    tables[name] = pd.read_sql("SELECT * FROM "+name,conn)

ed_visits
hospital_services
hospitals
paulboal_data
population
system_affiliations

In [9]:
tables

{'ed_visits':   hospital_name  year  ed_visits
 0           BJH  2016      72348
 1           BJH  2017      81221
 2     Mercy STL  2016      51932
 3     Mercy STL  2017      52221
 4         MoBap  2016      42983
 5         MoBap  2017      43921,
 'hospital_services':    hospital_name services
 0            BJH   Clinic
 1            BJH       ED
 2            BJH       IP
 3            BJH       OP
 4      Mercy STL       ED
 5      Mercy STL       IP
 6      Mercy STL       OP
 7          MoBap   Clinic
 8          MoBap       ED
 9          MoBap       IP
 10         MoBap       OP,
 'hospitals':   hospital_name       city system_name  beds
 0           BJH  St. Louis         BJC  1243
 1     Mercy STL      Ladue       Mercy  1120
 2         MoBap      Ladue         BJC   443,
 'paulboal_data':      index           X          Y  \
 0        0 -122.435802  37.769062
 1        1 -117.913856  33.774499
 2        2 -117.262672  34.539918
 3        3 -120.045618  36.945447
 4        4 -117.117197  33.470664
 ..     ...         ...        ...
 323    323 -121.995774  37.334574
 324    324 -118.156423  33.926359
 325    325 -119.451265  36.607796
 326    326 -118.326997  34.155912
 327    327 -118.294040  33.788973

                                     Provider_Name         NPI    CCN  \
 0                            Sutter Bay Hospitals  1659439834  50008
 1    PRIME HEALTHCARE SERVICES - GARDEN GROVE LLC  1659538858  50230
 2                          ST MARY MEDICAL CENTER  1669456299  50300
 3                       MADERA COMMUNITY HOSPITAL  1669673646  50568
 4                    Temecula Valley Hospital Inc  1679816201  50775
 ..                                            ...         ...    ...
 323                   KAISER FOUNDATION HOSPITALS  1326119967  50071
 324      COUNTY OF LOS ANGELES AUDITOR CONTROLLER  1336154020  50717
 325                    REEDLEY COMMUNITY HOSPITAL  1336167550  50192
 326  PROVIDENCE HEALTH SYSTEM-SOUTHERN CALIFORNIA  1336173269  50235
 327                   KAISER FOUNDATION HOSPITALS  1336294040  50411

     Medicaid_EP_Hospital_Type           Street_Address           City  \
 0        Acute Care Hospitals      CASTRO & DUBOCE STS  SAN FRANCISCO
 1        Acute Care Hospitals  12601 GARDEN GROVE BLVD   GARDEN GROVE
 2        Acute Care Hospitals      18300 US HIGHWAY 18   APPLE VALLEY
 3        Acute Care Hospitals        1250 E ALMOND AVE         MADERA
 4        Acute Care Hospitals      31700 TEMECULA PKWY       TEMECULA
 ..                        ...                      ...            ...
 323      Acute Care Hospitals        700 LAWRENCE EXPY    SANTA CLARA
 324      Acute Care Hospitals      7601 E IMPERIAL HWY         DOWNEY
 325      Acute Care Hospitals        372 W CYPRESS AVE        REEDLEY
 326      Acute Care Hospitals        501 S BUENA VISTA        BURBANK
 327      Acute Care Hospitals      25825 S VERMONT AVE    HARBOR CITY

              County  ... Payment_Year_Number       Program_Type  \
 0     San Francisco  ...                   3  Medicare/Medicaid
 1            Orange  ...                   4  Medicare/Medicaid
 2    San Bernardino  ...                   3  Medicare/Medicaid
 3            Madera  ...                   4  Medicare/Medicaid
 4         Riverside  ...                   1  Medicare/Medicaid
 ..              ...  ...                 ...                ...
 323     Santa Clara  ...                   1  Medicare/Medicaid
 324     Los Angeles  ...                   2  Medicare/Medicaid
 325          Fresno  ...                   3  Medicare/Medicaid
 326     Los Angeles  ...                   4  Medicare/Medicaid
 327     Los Angeles  ...                   2  Medicare/Medicaid

      Total_payments Last_Program_Year  Last_Payment_Year  \
 0            638474              2015               2017
 1           3947489              2014               2015
 2           3062645              2014               2015
 3           2057365              2015               2016
 4            474790              2016               2017
 ..              ...               ...                ...
 323          339080              2016               2017
 324         3686626              2016               2018
 325         2520247              2015               2018
 326         2326084              2014               2015
 327          358649              2016               2018

      Last_Payment_Criteria  Most_Recent_Disbursement_Amount   LONGITUDE  \
 0                       MU                            70942 -122.435802
 1                       MU                           394749 -117.913856
 2                       MU                           340294 -117.262672
 3                       MU                           205737 -120.045618
 4                      AIU                           474790 -117.117197
 ..                     ...                              ...         ...
 323                     MU                           339080 -121.995774
 324                     MU                          1382485 -118.156423
 325                     MU                           280027 -119.451265
 326                     MU                           232608 -118.326997
 327                     MU                           134493 -118.294040

       LATITUDE  FID
 0    37.769062    1
 1    33.774499    2
 2    34.539918    3
 3    36.945447    4
 4    33.470664    5
 ..         ...  ...
 323  37.334574  324
 324  33.926359  325
 325  36.607796  326
 326  34.155912  327
 327  33.788973  328

 [328 rows x 22 columns],
 'population':     zipcode  population  median_age  total_males  total_females  \
 0     91371           1        73.5            0              1
 1     90001       57110        26.6        28468          28642
 2     90002       51223        25.5        24876          26347
 3     90003       66266        26.3        32631          33635
 4     90004       62180        34.8        31302          30878
 ..      ...         ...         ...          ...            ...
 314   93552       38158        28.4        18711          19447
 315   93553        2138        43.3         1121           1017
 316   93560       18910        32.4         9491           9419
 317   93563         388        44.5          263            125
 318   93591        7285        30.9         3653           3632

      total_households  avg_household
 0                   1           1.00
 1               12971           4.40
 2               11731           4.36
 3               15642           4.22
 4               22547           2.73
 ..                ...            ...
 314              9690           3.93
 315               816           2.62
 316              6469           2.92
 317               103           2.53
 318              1982           3.67

 [319 rows x 7 columns],
 'system_affiliations':   system_name    affiliation
 0         BJC  Non-Religious
 1       Mercy       Catholic}

# All the hospitals that are not affiliated with the Catholic church

This time, using Pandas

In [11]:
hospitals = tables['hospitals'].merge(tables['system_affiliations'])

In [12]:
hospitals

  hospital_name       city system_name  beds    affiliation
0           BJH  St. Louis         BJC  1243  Non-Religious
1         MoBap      Ladue         BJC   443  Non-Religious
2     Mercy STL      Ladue       Mercy  1120       Catholic

In [13]:
hospitals[hospitals['affiliation'] != 'Catholic']

  hospital_name       city system_name  beds    affiliation
0           BJH  St. Louis         BJC  1243  Non-Religious
1         MoBap      Ladue         BJC   443  Non-Religious

## Hospitals with more than 43,000 ED visits each year

First in SQL

In [10]:
pd.read_sql_query("""
  SELECT h.*, v.*
  FROM 
    hospitals h JOIN
    ed_visits v ON h.hospital_name = v.hospital_name
  WHERE
    v.ed_visits > 43000
""", conn)

  hospital_name       city system_name  beds hospital_name  year  ed_visits
0           BJH  St. Louis         BJC  1243           BJH  2016      72348
1           BJH  St. Louis         BJC  1243           BJH  2017      81221
2     Mercy STL      Ladue       Mercy  1120     Mercy STL  2016      51932
3     Mercy STL      Ladue       Mercy  1120     Mercy STL  2017      52221
4         MoBap      Ladue         BJC   443         MoBap  2017      43921

Now, let's use SQL to pivot that so that we can see 2016 and 2017 in two separate columns...

# ...

Come on.  Let's do it?

# ...

Oh.  That isn't supported.  :(

## Let's try with Pandas

In [14]:
visits = tables['hospitals'].merge(tables['ed_visits'])

In [15]:
visits

  hospital_name       city system_name  beds  year  ed_visits
0           BJH  St. Louis         BJC  1243  2016      72348
1           BJH  St. Louis         BJC  1243  2017      81221
2     Mercy STL      Ladue       Mercy  1120  2016      51932
3     Mercy STL      Ladue       Mercy  1120  2017      52221
4         MoBap      Ladue         BJC   443  2016      42983
5         MoBap      Ladue         BJC   443  2017      43921

In [16]:
visits = visits[visits['ed_visits'] > 43000]

In [17]:
visits

  hospital_name       city system_name  beds  year  ed_visits
0           BJH  St. Louis         BJC  1243  2016      72348
1           BJH  St. Louis         BJC  1243  2017      81221
2     Mercy STL      Ladue       Mercy  1120  2016      51932
3     Mercy STL      Ladue       Mercy  1120  2017      52221
5         MoBap      Ladue         BJC   443  2017      43921

In [18]:
pd.pivot_table(visits, 
               index=['hospital_name','city','system_name','beds'], 
               columns='year', 
               values='ed_visits').reset_index()

year hospital_name       city system_name  beds     2016     2017
0              BJH  St. Louis         BJC  1243  72348.0  81221.0
1        Mercy STL      Ladue       Mercy  1120  51932.0  52221.0
2            MoBap      Ladue         BJC   443      NaN  43921.0

## OK.  We can do it in SQL...

But can you figure out why this is a bad idea?

In [19]:
pd.read_sql_query("""
  SELECT 
    h.*, v.year, 
    CASE WHEN v.year = 2016 THEN v.ed_visits ELSE NULL END as visits_2016,
    CASE WHEN v.year = 2017 THEN v.ed_visits ELSE NULL END as visits_2017
  FROM 
    hospitals h JOIN
    ed_visits v ON h.hospital_name = v.hospital_name
  WHERE
    v.ed_visits > 43000
""", conn)

  hospital_name       city system_name  beds  year  visits_2016  visits_2017
0           BJH  St. Louis         BJC  1243  2016      72348.0          NaN
1           BJH  St. Louis         BJC  1243  2017          NaN      81221.0
2     Mercy STL      Ladue       Mercy  1120  2016      51932.0          NaN
3     Mercy STL      Ladue       Mercy  1120  2017          NaN      52221.0
4         MoBap      Ladue         BJC   443  2017          NaN      43921.0

In [20]:
pd.read_sql_query("""
  SELECT 
    h.*, 
    MIN(CASE WHEN v.year = 2016 THEN v.ed_visits ELSE NULL END) as visits_2016,
    MIN(CASE WHEN v.year = 2017 THEN v.ed_visits ELSE NULL END) as visits_2017
  FROM 
    hospitals h JOIN
    ed_visits v ON h.hospital_name = v.hospital_name
  WHERE
    v.ed_visits > 43000
  GROUP BY 
    h.hospital_name, h.city, h.system_name, h.beds
""", conn)

  hospital_name       city system_name  beds  visits_2016  visits_2017
0           BJH  St. Louis         BJC  1243      72348.0        81221
1     Mercy STL      Ladue       Mercy  1120      51932.0        52221
2         MoBap      Ladue         BJC   443          NaN        43921

## Now, let's create some new data from scratch

1. Create a dataframe
2. Use a name that includes your username so that it's unique
3. Write the df to a new table
4. Query your data back out

See https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.to_sql.html

In [21]:
columns = ['hospital_name','year','ip_visits']
data = [
    ['BJH',2016,3124],
    ['Mercy STL',2016,4321],
    ['MoBap',2016,2783]
]
df = pd.DataFrame(data, columns=columns)

In [22]:
df

  hospital_name  year  ip_visits
0           BJH  2016       3124
1     Mercy STL  2016       4321
2         MoBap  2016       2783

In [23]:
import getpass
myname = getpass.getuser().split('-')[1]
myname

'paulboal'

In [24]:
df.to_sql(myname + '_ipv', conn, index=False)

In [25]:
ip_visits = pd.read_sql_query('SELECT * FROM ' + myname + '_ipv', conn)

In [26]:
ip_visits

  hospital_name  year  ip_visits
0           BJH  2016       3124
1     Mercy STL  2016       4321
2         MoBap  2016       2783

In [29]:
pd.read_sql_query('SHOW TABLES', conn)

     Tables_in_hds5210
0            ed_visits
1    hospital_services
2            hospitals
3        paulboal_data
4           population
5  system_affiliations

## And we need to clean up after ourselves by dropping our table

In [28]:
with conn.connect() as c:
    c.execute('DROP TABLE IF EXISTS ' + myname + '_ipv')